# HW2
In this assignment, you will learn how to preprocess data using SQLite and Pandas.<br>
When submitting, rename the file to HW02_[student_id].ipynb (ex.HW02_20211234.ipynb) and submit it to PLMS.

In [1]:
import sqlite3
import pandas as pd

## 1. SQLite and Python

### a. Create a SQLite Database
Here, you will learn how to connect a SQLite database and insert a data into it.<br>
1. Create and connect a database named `temp.db`.<br>
2. Create a table named `Airbnb` where the column names are 'ㅇ' respectively.<br>
    (You don't need to specify a data type.)<br>
3. Insert the data below **at once** and save the changes. <br>

    | City      | Price | Hostname | Latitude | Longitude |
    | :- | :- | :- | :- | :- |
    | New York  | 100   | Jennifer | 40.75    | -73.983   |
    | New York  | 175   | Andy     | 40.66536 | -74.264   |
    | Hawaii    | 200   | Edward   | 19.453   | -155.3579 |
    | San Diego | 68    | Isabel   | 32.473   | -117.1263 |
    | San Diego | 96    | Alice    | 32.5852  | -117.2361 |


4. Create a table named `Crime` and insert the data below **at once** and save the changes. <br>

    | Location      | Year | Num_crime |
    | :- | :- | :- |
    | New York  | 2021   | 1957 | 
    | New York  | 2022   | 2395     | 
    | San Diego    | 2021   | 749   | 
    | San Diego | 2022    | 627   | 

5. Create a table named `Job` and insert the data below **one by one** and save the changes. <br>

    | Employee      | Company | Gender |
    | :- | :- | :- |
    | Andy  | Amazon   | M | 
    | Isabel  | Netflix   | F     |

In [59]:
#conn = sqlite3.connect("", isolation_level=None)

import sqlite3

con = sqlite3.connect("temp.db")
cur = con.cursor()

cur.execute("CREATE TABLE IF NOT EXISTS Airbnb(City VARCHAR(255),Price INTEGER,Hostname VARCHAR(255),Latitude FLOAT,Longitude FLOAT)")
Airbnb_list = (
['New York', 100, 'Jennifer', 40.75, -73.983],
['New York', 175, 'Andy', 40.66536, -74.264],
['Hawaii', 200, 'Edward', 19.453, -155.3579],
['San Diego', 68, 'Isabel', 32.473, -117.1263],
['San Diego', 96, 'Alice', 32.5852, -117.2361]
)
cur.executemany("INSERT INTO 'Airbnb'(City,Price,Hostname,Latitude,Longitude) VALUES(?,?,?,?,?)", Airbnb_list)

cur.execute("CREATE TABLE IF NOT EXISTS Crime(Location VARCHAR(255), Year INTEGER, Num_crime INTEGER)")
Crime_list = (
['New York', 2021, 1957],
['New York', 2022, 2395],
['San Diego', 2021, 749],
['San Diego', 2022, 629]
)
cur.executemany("INSERT INTO 'Crime'(Location, Year, Num_crime) VALUES(?,?,?)", Crime_list)

cur.execute("CREATE TABLE IF NOT EXISTS Job(Employee VARCHAR(255), Company VARCHAR(255), Gender VARCHAR(1))")
cur.execute("INSERT INTO 'Job'(Employee, Company, Gender) VALUES(?,?,?)", ('Andy', 'Amazon', 'M'))
cur.execute("INSERT INTO 'Job'(Employee, Company, Gender) VALUES(?,?,?)", ('Isabel', 'Netflix', 'F'))

#cur.execute("SELECT * FROM 'Airbnb';")
#print(cur.fetchall())
#cur.execute("SELECT * FROM 'Crime';")
#print(cur.fetchall())
#cur.execute("SELECT * FROM 'Job';")
#print(cur.fetchall())

con.commit()
con.close()

6. Connect database named `temp.db` and print all data in `Airbnb`.
    (Printed results should be a list of tuples.)

In [60]:
import sqlite3

con = sqlite3.connect("temp.db")
cur = con.cursor()

cur.execute("SELECT * FROM 'Airbnb';")
print(cur.fetchall())
cur.execute("SELECT * FROM 'Crime';")
print(cur.fetchall())
cur.execute("SELECT * FROM 'Job';")
print(cur.fetchall())

con.commit()
con.close()

[('New York', 100, 'Jennifer', 40.75, -73.983), ('New York', 175, 'Andy', 40.66536, -74.264), ('Hawaii', 200, 'Edward', 19.453, -155.3579), ('San Diego', 68, 'Isabel', 32.473, -117.1263), ('San Diego', 96, 'Alice', 32.5852, -117.2361)]
[('New York', 2021, 1957), ('New York', 2022, 2395), ('San Diego', 2021, 749), ('San Diego', 2022, 629)]
[('Andy', 'Amazon', 'M'), ('Isabel', 'Netflix', 'F')]

### b. Execute Queries
Here, you will execute multiple queries using the database `temp.db`.<br>
1. Connect the database `temp.db` and print Airbnb in New York that costs less than 120.<br>
(Printed results should be either a list of tuples or a tuple.)

In [61]:
import sqlite3

con =sqlite3.connect("temp.db")
cur = con.cursor()

cur.execute ("SELECT * FROM 'Airbnb' WHERE City='New York' AND Price <120;")
print(f'{cur.fetchall()}')

con.commit()
con.close()

[('New York', 100, 'Jennifer', 40.75, -73.983)]

2. Connect the database `temp.db` and output the average crime rate by city in descending order.

In [62]:
con =sqlite3.connect("temp.db")
cur = con.cursor()

cur.execute("SELECT Location, avg(Num_crime) FROM Crime GROUP BY Location ORDER BY avg(Num_crime) DESC;")
print(f'{cur.fetchall()}')

con.commit()
con.close()

[('New York', 2176.0), ('San Diego', 689.0)]

3. Connect the database `temp.db`.<br>
    Select City, Price, Hostname from `Airbnb` and select all columns from `Job`.<br>
    Left join `Airbnb` and `Job` using 'Name' and 'Employee' columns respectively.

In [63]:
import sqlite3

con =sqlite3.connect("temp.db")
cur = con.cursor()

cur.execute("SELECT Airbnb.City, Airbnb.Price, Airbnb.Hostname, Job.Company, Job.Gender From Airbnb LEFT JOIN Job ON Airbnb.Hostname = Job.Employee")
print(f'{cur.fetchall()}')

con.commit()
con.close()

[('New York', 100, 'Jennifer', None, None), ('New York', 175, 'Andy', 'Amazon', 'M'), ('Hawaii', 200, 'Edward', None, None), ('San Diego', 68, 'Isabel', 'Netflix', 'F'), ('San Diego', 96, 'Alice', None, None)]

## 2. SQLite and Pandas
Here, you will convert SQLite data to Pandas dataframe and process it.<br>
Students must use Pandas library to solve problems.<br>
Reference: https://pythonspot.com/sqlite-database-with-pandas/

1. Connect the database `temp.db` and print Airbnb in New York that costs less than 120.

In [64]:
con =sqlite3.connect("temp.db")
cur = con.cursor()

import pandas as pd
from pandas import DataFrame

connection = sqlite3.connect('temp.db')
df1 = pd.read_sql("SELECT * FROM Airbnb;",connection)
df2 = df1.loc[df1['City'] == 'New York']
df3 = df2[df2['Price']<120]
print(df3)

con.commit()
con.close()

       City  Price  Hostname  Latitude  Longitude
0  New York    100  Jennifer     40.75    -73.983

2. Connect the database `temp.db` and output the average crime rate by city in descending order.

In [65]:
import pandas as pd
from pandas import DataFrame

con =sqlite3.connect("temp.db")
cur = con.cursor()

connection = sqlite3.connect('temp.db')
df1 = pd.read_sql("SELECT * FROM Crime;",connection)

df2 = df1.groupby('Location')['Num_crime'].agg(**{'Num_crime_avg':'mean'})
print(df2)

con.commit()
con.close()

           Num_crime_avg
Location
New York          2176.0
San Diego          689.0

3. Connect the database `temp.db`.<br>
    Select City, Price, Hostname from `Airbnb` and select all columns from `Job`.<br>
    Left join `Airbnb` and `Job` using 'Name' and 'Employee' columns respectively.<br>
    Write and save the output dataframe to sql table named `Address`.

In [66]:
import sqlite3
import pandas as pd
from pandas import DataFrame

con =sqlite3.connect("temp.db")
cur = con.cursor()

connection = sqlite3.connect('temp.db')
df1 = pd.read_sql("SELECT City, Price, Hostname FROM Airbnb;",connection)
df2 = pd.read_sql("SELECT * FROM Job;",connection)
#df3 = pd.merge(left= df1, right=df2, left_on='Hostname', right_on='Employee', how='left')
df3 = pd.merge(df1, df2, how='left', left_on='Hostname', right_on='Employee')
df3.to_sql("Address", con, if_exists="replace", index=False)

con.commit()
con.close()

4. Connect the database `temp.db` and print all rows and columns in the `Address` table.

In [67]:
import sqlite3
import pandas as pd
from pandas import DataFrame

con =sqlite3.connect("temp.db")
cur = con.cursor()

cur.execute ("SELECT * FROM Address;")
print(f'{cur.fetchall()}')

con.commit()
con.close()

[('New York', 100, 'Jennifer', None, None, None), ('New York', 175, 'Andy', 'Andy', 'Amazon', 'M'), ('Hawaii', 200, 'Edward', None, None, None), ('San Diego', 68, 'Isabel', 'Isabel', 'Netflix', 'F'), ('San Diego', 96, 'Alice', None, None, None)]

## 3. SQL Query
Here, students must use **sqlite shell** to solve problems.<br>
Do not write python scripts that use sqlite3 library.<br>
You may encounter errors when running cells on jupyter notebook, but it is okay as long as it works fine on the sqlite shell.

| 1  | data   | 4 | 
| :- | :- | :- |
| 1  | base   | 3 | 
| 1  | system   | 5 | 
| 1  | fall   | 6 | 
| 1  | semester   | 2 | 
| 2  | data   | 1 | 
| 2  | base   | 2 | 
| 2  | structure   | 3 | 
| 2  | network   | 4 | 
| 2  | algorithm   | 5 | 
| 3  | ds   | 2 | 
| 3  | sd   | 3 | 
| 3  | final   | 4 | 
| 3  | mid   | 5 | 
| 4  | system   | 1 | 
| 4  | ds   | 4 | 
| 4  | sd   | 3 | 
| 4  | pl   | 5 | 
| 4  | data   | 2 | 
| 5  | base   | 2 | 
| 5  | structure   | 2 | 
| 5  | network   | 3 | 
| 5  | fall   | 4 | 
| 6  | data   | 2 | 
| 6  | base   | 4 |

### a. Import CSV
Make a csv file from the data above and import it to SQLite database.<br>
Execute the query below in the sqlite shell.
- Create table Documents(DocID int, Term text, Count int);
- .mode csv
- .import [csvpath]/Document.csv Documents

In [ ]:
#CREATE TABLE Documents(DocID int,Term text,Count int);
#INSERT INTO Documents values (1, 'data', 4);
#INSERT INTO Documents values (1, 'base', 3);
#INSERT INTO Documents values (1, 'system', 5); 
#INSERT INTO Documents values (1, 'fall', 6);
#INSERT INTO Documents values (1, 'semester',2);
#INSERT INTO Documents values (2, 'data', 1); 
#INSERT INTO Documents values (2, 'base', 2); 
#INSERT INTO Documents values (2, 'structure', 3); 
#INSERT INTO Documents values (2, 'network', 4); 
#INSERT INTO Documents values (2, 'algorithm', 5); 
#INSERT INTO Documents values (3, 'ds', 2); 
#INSERT INTO Documents values (3, 'sd', 3); 
#INSERT INTO Documents values (3, 'final', 4); 
#INSERT INTO Documents values (3, 'mid', 5); 
#INSERT INTO Documents values (4, 'system', 1); 
#INSERT INTO Documents values (4, 'ds', 4); 
#INSERT INTO Documents values (4, 'sd', 3); 
#INSERT INTO Documents values (4, 'pl', 5); 
#INSERT INTO Documents values (4, 'data', 2); 
#INSERT INTO Documents values (5, 'base', 2); 
#INSERT INTO Documents values (5, 'structure', 2); 
#INSERT INTO Documents values (5, 'network', 3);
#INSERT INTO Documents values (5, 'fall', 4);
#INSERT INTO Documents values (6, 'data', 2); 
#INSERT INTO Documents values (6, 'base', 4);

#.header on
#.mode csv
#.output Document.csv
#SELECT * FROM Documents;
#.import /Users/jeongjaehyeon/Document.csv Documents

### b. Relational Algebra Expression
Write an SQL Query that is equivalemt to the following relational algebra expression.<br>

1. $\pi_{Term}(σ_{DocID=2(Documents)}) \cup π_{Term}(σ_{count=3(Documents)})$
2. Try both union and union all to see the difference
3. Try “or” instead of “union” and compare results with using union

In [ ]:
SELECT Term FROM Documents WHERE DocID=2
UNION ALL
SELECT Term FROM Documents WHERE Count=3;
# UNION ALL는 두 조건을 더하므로 같은 행을 중복해서 만들고, 중복제거를 하지 않음

SELECT Term FROM Documents WHERE DocID=2
UNION
SELECT Term FROM Documents WHERE Count=3;
# UNION은 중복 제거를 한다.

SELECT Term FROM Documents WHERE (DocID=2 OR Count=3);
# OR은 한번에 이 조건을 통과하는 행을 센다는 점에서 차이가 있다.
# UNION ALL과 다르게 structure 한개가 없음

### c. SQLite Query Exercise-1

1. Write an SQL query that counts the number of documents that contain either the word “system” or “data”.

In [ ]:
SELECT COUNT(distinct DocID) FROM Documents WHERE Term = 'system' or Term='data';
#SELECT COUNT(*) from Documents where Term = 'system' OR Term = 'data';
#from xml.dom.minidom import Document
#SELECT COUNT(name) as cnt FROM hero_collection;

2. Write an SQL query that returns total count of each Terms in all DocID. Do not include DocID in the final result.

In [ ]:
SELECT SUM(Count) FROM Documents GROUP BY DocID;
#SELECT COUNT(*) from Documents group by DocID;
#SELECT DocID, count(*) from Documents group by DocID;

3. Write an SQL query that finds all documents that have more than 4 distinct terms.

In [ ]:
SELECT DocID FROM Documents GROUP BY DocID HAVING COUNT(DISTINCT Term) > 4;

#SELECT Term, COUNT(Term) AS cnt FROM Documents GROUP BY Term HAVING cnt > 4
#SELECT COUNT(name) as cnt FROM hero_collection;
#SELECT COUNT(Term) as cnt from Documents where Term = 'system'OR Term = 'data';

### d. SQLite Query Exercise-2
Write an SQL query to compute the similarity of every pair of documents in Documents. <br>
The similarity here is computed by summing the same term counts of two documents.<br>
For example, the similarity of Doc1 <’a’:2, ‘b’:1, ‘c’:3> and Doc2 <’b’:2, ‘c’:1, ‘d’:4> is 1*2 (‘b’) + 3*1 (‘c’) = 5.<br>
(Hint: to avoid computing the similarity of both (Doc1, Doc2) and (Doc2, Doc1), add a condition of the form a.DocID < b.DocID.)<br>
 1*2 (‘b’) + 3*1 (‘c’) = 5

## Reference:

https://docs.python.org/3/library/sqlite3.html?highlight=sqlite#module-sqlite3